app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hi ! this is a test message"], ["user_id", 2], ["created_at", "2022-03-17 04:26:05.240237"], ["updated_at", "2022-03-17 04:26:05.240237"]]
---
	def create
		message = current_user.messages.build(message_params)
		#.build commands build the assocaition defined between user and messages.
		if message.save